luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxScu_regdef.h
/** \brief  EVR ADC Status Register */
typedef struct _Ifx_SCU_EVRADCSTAT_Bits
{
    unsigned int ADC13V:8;                  /**< \brief [7:0] ADC 1.3 V Conversion Result (rh) */
    unsigned int ADC33V:8;                  /**< \brief [15:8] ADC 3.3 V Conversion Result (rh) */
    unsigned int ADCSWDV:8;                 /**< \brief [23:16] ADC External Supply Conversion Result (rh) */
    unsigned int reserved_24:7;             /**< \brief \internal Reserved */
    unsigned int VAL:1;                     /**< \brief [31:31] Valid Status (rh) */
} Ifx_SCU_EVRADCSTAT_Bits;

/** \brief  EVR Status Register for Voltage Scaling */
typedef struct _Ifx_SCU_EVRDVSTAT_Bits
{
    unsigned int DVS13TRIM:8;               /**< \brief [7:0] 1.3 V Regulator Voltage Trim Status (rh) */
    unsigned int reserved_8:8;              /**< \brief \internal Reserved */
    unsigned int DVS33TRIM:8;               /**< \brief [23:16] 3.3 V Regulator Voltage Trim Status (rh) */
    unsigned int reserved_24:7;             /**< \brief \internal Reserved */
    unsigned int VAL:1;                     /**< \brief [31:31] Valid Status (rh) */
} Ifx_SCU_EVRDVSTAT_Bits;

/** \brief  EVR Monitor Control Register */
typedef struct _Ifx_SCU_EVRMONCTRL_Bits
{
    unsigned int EVR13OVMOD:2;              /**< \brief [1:0] 1.3 V Regulator Over-voltage monitoring mode (rw) */
    unsigned int reserved_2:2;              /**< \brief \internal Reserved */
    unsigned int EVR13UVMOD:2;              /**< \brief [5:4] 1.3 V Regulator Under-voltage monitoring mode (rw) */
    unsigned int reserved_6:2;              /**< \brief \internal Reserved */
    unsigned int EVR33OVMOD:2;              /**< \brief [9:8] 3.3 V Regulator Over-voltage monitoring mode (rw) */
    unsigned int reserved_10:2;             /**< \brief \internal Reserved */
    unsigned int EVR33UVMOD:2;              /**< \brief [13:12] 3.3 V Regulator Under-voltage monitoring mode (rw) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int SWDOVMOD:2;                /**< \brief [17:16] Supply monitor (SWD) Over-voltage monitoring mode (rw) */
    unsigned int reserved_18:2;             /**< \brief \internal Reserved */
    unsigned int SWDUVMOD:2;                /**< \brief [21:20] Supply monitor (SWD) Under-voltage monitoring mode (rw) */
    unsigned int reserved_22:8;             /**< \brief \internal Reserved */
    unsigned int SLCK:1;                    /**< \brief [30:30] HSM Security Lock (rwh) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_SCU_EVRMONCTRL_Bits;

/** \brief  EVR Over-voltage Configuration Register */
typedef struct _Ifx_SCU_EVROVMON_Bits
{
    unsigned int EVR13OVVAL:8;              /**< \brief [7:0] 1.3 V Regulator Over-voltage threshold (rw) */
    unsigned int EVR33OVVAL:8;              /**< \brief [15:8] 3.3 V Regulator Over-voltage threshold (rw) */
    unsigned int SWDOVVAL:8;                /**< \brief [23:16] Supply monitor (SWD) Over-voltage threshold value (rw) */
    unsigned int reserved_24:6;             /**< \brief \internal Reserved */
    unsigned int SLCK:1;                    /**< \brief [30:30] HSM Security Lock (rwh) */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVROVMON_Bits;

/** \brief  EVR Reset Control Register */
typedef struct _Ifx_SCU_EVRRSTCON_Bits
{
    unsigned int RST13TRIM:8;               /**< \brief [7:0] 1.3 V Regulator Reset Trim Value (rw) */
    unsigned int reserved_8:16;             /**< \brief \internal Reserved */
    unsigned int RST13OFF:1;                /**< \brief [24:24] EVR13 Reset Enable (rw) */
    unsigned int BPRST13OFF:1;              /**< \brief [25:25] Bit Protection RST13OFF (w) */
    unsigned int RST33OFF:1;                /**< \brief [26:26] EVR33 Reset Enable (rw) */
    unsigned int BPRST33OFF:1;              /**< \brief [27:27] Bit Protection RST33OFF (w) */
    unsigned int RSTSWDOFF:1;               /**< \brief [28:28] EVR SWD Reset Enable (rw) */
    unsigned int BPRSTSWDOFF:1;             /**< \brief [29:29] Bit Protection RSTSWDOFF (w) */
    unsigned int SLCK:1;                    /**< \brief [30:30] HSM Security Lock (rwh) */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRRSTCON_Bits;

/** \brief  EVR13 SD Coefficient Register 1 */
typedef struct _Ifx_SCU_EVRSDCOEFF1_Bits
{
    unsigned int SD5P:8;                    /**< \brief [7:0] P Coefficient (rw) */
    unsigned int SD5I:8;                    /**< \brief [15:8] I Coefficient (rw) */
    unsigned int SD5D:8;                    /**< \brief [23:16] D Coefficient (rw) */
    unsigned int reserved_24:7;             /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRSDCOEFF1_Bits;

/** \brief  EVR13 SD Coefficient Register 2 */
typedef struct _Ifx_SCU_EVRSDCOEFF2_Bits
{
    unsigned int SD33P:8;                   /**< \brief [7:0] P Coefficient (rw) */
    unsigned int SD33I:8;                   /**< \brief [15:8] I Coefficient (rw) */
    unsigned int SD33D:8;                   /**< \brief [23:16] D Coefficient (rw) */
    unsigned int reserved_24:7;             /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRSDCOEFF2_Bits;

/** \brief  EVR13 SD Coefficient Register 3 */
typedef struct _Ifx_SCU_EVRSDCOEFF3_Bits
{
    unsigned int CT5REG0:8;                 /**< \brief [7:0] Commutation trimming (rw) */
    unsigned int CT5REG1:8;                 /**< \brief [15:8] Commutation trimming (rw) */
    unsigned int CT5REG2:8;                 /**< \brief [23:16] Commutation trimming (rw) */
    unsigned int reserved_24:7;             /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRSDCOEFF3_Bits;

/** \brief  EVR13 SD Coefficient Register 4 */
typedef struct _Ifx_SCU_EVRSDCOEFF4_Bits
{
    unsigned int CT5REG3:8;                 /**< \brief [7:0] Commutation trimming (rw) */
    unsigned int CT5REG4:8;                 /**< \brief [15:8] Commutation trimming (rw) */
    unsigned int reserved_16:15;            /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRSDCOEFF4_Bits;

