luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxScu_regdef.h
/** \brief  Access Enable Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_ACCEN1_Bits B;                  /**< \brief Bitfield access */
} Ifx_SCU_ACCEN1;

/** \brief  Application Reset Disable Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_ARSTDIS_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_ARSTDIS;

/** \brief  CCU Clock Control Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_CCUCON0_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_CCUCON0;

/** \brief  CCU Clock Control Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_CCUCON1_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_CCUCON1;

/** \brief  CCU Clock Control Register 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_CCUCON2_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_CCUCON2;

/** \brief  CCU Clock Control Register 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_CCUCON3_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_CCUCON3;

/** \brief  CCU Clock Control Register 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_CCUCON4_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_CCUCON4;

/** \brief  CCU Clock Control Register 5 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_CCUCON5_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_CCUCON5;

/** \brief  CCU Clock Control Register 6 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_CCUCON6_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_CCUCON6;

/** \brief  CCU Clock Control Register 7 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_CCUCON7_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_CCUCON7;

/** \brief  CCU Clock Control Register 8 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_CCUCON8_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_CCUCON8;

/** \brief  Chip Identification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_CHIPID_Bits B;                  /**< \brief Bitfield access */
} Ifx_SCU_CHIPID;

/** \brief  Die Temperature Sensor Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_DTSCON_Bits B;                  /**< \brief Bitfield access */
} Ifx_SCU_DTSCON;

/** \brief  Die Temperature Sensor Limit Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_DTSLIM_Bits B;                  /**< \brief Bitfield access */
} Ifx_SCU_DTSLIM;

/** \brief  Die Temperature Sensor Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_DTSSTAT_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_DTSSTAT;

/** \brief  External Input Channel Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EICR_Bits B;                    /**< \brief Bitfield access */
} Ifx_SCU_EICR;

/** \brief  External Input Flag Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EIFR_Bits B;                    /**< \brief Bitfield access */
} Ifx_SCU_EIFR;

/** \brief  Emergency Stop Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EMSR_Bits B;                    /**< \brief Bitfield access */
} Ifx_SCU_EMSR;

/** \brief  ESR Input Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_ESRCFG_Bits B;                  /**< \brief Bitfield access */
} Ifx_SCU_ESRCFG;

/** \brief  ESR Output Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_ESROCFG_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_ESROCFG;

/** \brief  EVR13 Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVR13CON_Bits B;                /**< \brief Bitfield access */
} Ifx_SCU_EVR13CON;

/** \brief  EVR33 Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVR33CON_Bits B;                /**< \brief Bitfield access */
} Ifx_SCU_EVR33CON;

