luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxScu_regdef.h
/** \brief  EVR ADC Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVRADCSTAT_Bits B;              /**< \brief Bitfield access */
} Ifx_SCU_EVRADCSTAT;

/** \brief  EVR Status Register for Voltage Scaling */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVRDVSTAT_Bits B;               /**< \brief Bitfield access */
} Ifx_SCU_EVRDVSTAT;

/** \brief  EVR Monitor Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVRMONCTRL_Bits B;              /**< \brief Bitfield access */
} Ifx_SCU_EVRMONCTRL;

/** \brief  EVR Over-voltage Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVROVMON_Bits B;                /**< \brief Bitfield access */
} Ifx_SCU_EVROVMON;

/** \brief  EVR Reset Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVRRSTCON_Bits B;               /**< \brief Bitfield access */
} Ifx_SCU_EVRRSTCON;

/** \brief  EVR13 SD Coefficient Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVRSDCOEFF1_Bits B;             /**< \brief Bitfield access */
} Ifx_SCU_EVRSDCOEFF1;

/** \brief  EVR13 SD Coefficient Register 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVRSDCOEFF2_Bits B;             /**< \brief Bitfield access */
} Ifx_SCU_EVRSDCOEFF2;

/** \brief  EVR13 SD Coefficient Register 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVRSDCOEFF3_Bits B;             /**< \brief Bitfield access */
} Ifx_SCU_EVRSDCOEFF3;

/** \brief  EVR13 SD Coefficient Register 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVRSDCOEFF4_Bits B;             /**< \brief Bitfield access */
} Ifx_SCU_EVRSDCOEFF4;

/** \brief  EVR13 SD Coefficient Register 5 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVRSDCOEFF5_Bits B;             /**< \brief Bitfield access */
} Ifx_SCU_EVRSDCOEFF5;

/** \brief  EVR13 SD Coefficient Register 6 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVRSDCOEFF6_Bits B;             /**< \brief Bitfield access */
} Ifx_SCU_EVRSDCOEFF6;

/** \brief  EVR13 SD Control Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVRSDCTRL1_Bits B;              /**< \brief Bitfield access */
} Ifx_SCU_EVRSDCTRL1;

/** \brief  EVR13 SD Control Register 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVRSDCTRL2_Bits B;              /**< \brief Bitfield access */
} Ifx_SCU_EVRSDCTRL2;

/** \brief  EVR13 SD Control Register 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVRSDCTRL3_Bits B;              /**< \brief Bitfield access */
} Ifx_SCU_EVRSDCTRL3;

/** \brief  EVR13 SD Control Register 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVRSDCTRL4_Bits B;              /**< \brief Bitfield access */
} Ifx_SCU_EVRSDCTRL4;

/** \brief  EVR Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVRSTAT_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_EVRSTAT;

/** \brief  EVR Trim Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVRTRIM_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_EVRTRIM;

/** \brief  EVR Under-voltage Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVRUVMON_Bits B;                /**< \brief Bitfield access */
} Ifx_SCU_EVRUVMON;

/** \brief  External Clock Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EXTCON_Bits B;                  /**< \brief Bitfield access */
} Ifx_SCU_EXTCON;

/** \brief  Fractional Divider Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_FDR_Bits B;                     /**< \brief Bitfield access */
} Ifx_SCU_FDR;

/** \brief  Flag Modification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_FMR_Bits B;                     /**< \brief Bitfield access */
} Ifx_SCU_FMR;

