luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxScu_regdef.h
/** \brief  Identification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_ID_Bits B;                      /**< \brief Bitfield access */
} Ifx_SCU_ID;

/** \brief  Flag Gating Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_IGCR_Bits B;                    /**< \brief Bitfield access */
} Ifx_SCU_IGCR;

/** \brief  ESR Input Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_IN_Bits B;                      /**< \brief Bitfield access */
} Ifx_SCU_IN;

/** \brief  Input/Output Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_IOCR_Bits B;                    /**< \brief Bitfield access */
} Ifx_SCU_IOCR;

/** \brief  Logic BIST Control 0 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_LBISTCTRL0_Bits B;              /**< \brief Bitfield access */
} Ifx_SCU_LBISTCTRL0;

/** \brief  Logic BIST Control 1 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_LBISTCTRL1_Bits B;              /**< \brief Bitfield access */
} Ifx_SCU_LBISTCTRL1;

/** \brief  Logic BIST Control 2 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_LBISTCTRL2_Bits B;              /**< \brief Bitfield access */
} Ifx_SCU_LBISTCTRL2;

/** \brief  LCL CPU Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_LCLCON_Bits B;                  /**< \brief Bitfield access */
} Ifx_SCU_LCLCON;

/** \brief  LCL Test Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_LCLTEST_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_LCLTEST;

/** \brief  Manufacturer Identification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_MANID_Bits B;                   /**< \brief Bitfield access */
} Ifx_SCU_MANID;

/** \brief  ESR Output Modification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_OMR_Bits B;                     /**< \brief Bitfield access */
} Ifx_SCU_OMR;

/** \brief  OSC Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_OSCCON_Bits B;                  /**< \brief Bitfield access */
} Ifx_SCU_OSCCON;

/** \brief  ESR Output Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_OUT_Bits B;                     /**< \brief Bitfield access */
} Ifx_SCU_OUT;

/** \brief  Overlay Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_OVCCON_Bits B;                  /**< \brief Bitfield access */
} Ifx_SCU_OVCCON;

/** \brief  Overlay Enable Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_OVCENABLE_Bits B;               /**< \brief Bitfield access */
} Ifx_SCU_OVCENABLE;

/** \brief  Pad Disable Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PDISC_Bits B;                   /**< \brief Bitfield access */
} Ifx_SCU_PDISC;

/** \brief  ESR Pad Driver Mode Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PDR_Bits B;                     /**< \brief Bitfield access */
} Ifx_SCU_PDR;

/** \brief  Pattern Detection Result Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PDRR_Bits B;                    /**< \brief Bitfield access */
} Ifx_SCU_PDRR;

/** \brief  PLL Configuration 0 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PLLCON0_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_PLLCON0;

/** \brief  PLL Configuration 1 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PLLCON1_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_PLLCON1;

/** \brief  PLL Configuration 2 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PLLCON2_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_PLLCON2;

/** \brief  PLL_ERAY Configuration 0 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PLLERAYCON0_Bits B;             /**< \brief Bitfield access */
} Ifx_SCU_PLLERAYCON0;

