luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxScu_regdef.h
/** \brief  PLL_ERAY Configuration 1 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PLLERAYCON1_Bits B;             /**< \brief Bitfield access */
} Ifx_SCU_PLLERAYCON1;

/** \brief  PLL_ERAY Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PLLERAYSTAT_Bits B;             /**< \brief Bitfield access */
} Ifx_SCU_PLLERAYSTAT;

/** \brief  PLL Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PLLSTAT_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_PLLSTAT;

/** \brief  Power Management Control and Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PMCSR_Bits B;                   /**< \brief Bitfield access */
} Ifx_SCU_PMCSR;

/** \brief  Standby and Wake-up Control Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PMSWCR0_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_PMSWCR0;

/** \brief  Standby and Wake-up Control Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PMSWCR1_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_PMSWCR1;

/** \brief  Standby and Wake-up Status Flag Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PMSWSTAT_Bits B;                /**< \brief Bitfield access */
} Ifx_SCU_PMSWSTAT;

/** \brief  Standby and Wake-up Status Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PMSWSTATCLR_Bits B;             /**< \brief Bitfield access */
} Ifx_SCU_PMSWSTATCLR;

/** \brief  Reset Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_RSTCON_Bits B;                  /**< \brief Bitfield access */
} Ifx_SCU_RSTCON;

/** \brief  Additional Reset Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_RSTCON2_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_RSTCON2;

/** \brief  Reset Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_RSTSTAT_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_RSTSTAT;

/** \brief  Safety Heartbeat Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_SAFECON_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_SAFECON;

/** \brief  Start-up Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_STSTAT_Bits B;                  /**< \brief Bitfield access */
} Ifx_SCU_STSTAT;

/** \brief  Software Reset Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_SWRSTCON_Bits B;                /**< \brief Bitfield access */
} Ifx_SCU_SWRSTCON;

/** \brief  System Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_SYSCON_Bits B;                  /**< \brief Bitfield access */
} Ifx_SCU_SYSCON;

/** \brief  Trap Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_TRAPCLR_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_TRAPCLR;

/** \brief  Trap Disable Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_TRAPDIS_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_TRAPDIS;

/** \brief  Trap Set Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_TRAPSET_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_TRAPSET;

/** \brief  Trap Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_TRAPSTAT_Bits B;                /**< \brief Bitfield access */
} Ifx_SCU_TRAPSTAT;

/** \brief  CPU WDT Control Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_WDTCPU_CON0_Bits B;             /**< \brief Bitfield access */
} Ifx_SCU_WDTCPU_CON0;

/** \brief  CPU WDT Control Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_WDTCPU_CON1_Bits B;             /**< \brief Bitfield access */
} Ifx_SCU_WDTCPU_CON1;

/** \brief  CPU WDT Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_WDTCPU_SR_Bits B;               /**< \brief Bitfield access */
} Ifx_SCU_WDTCPU_SR;

